src/Enums/СтатусыСтудента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыСтудента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Абитуриент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Студент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчислен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выпущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыФинансирования</Name>
			<Comment>Бюджет или платное</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БюджетноеФинансирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеФинансирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолЧеловека</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачисленПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБилета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗачетки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедПолисСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Номер, серия. кем выдан, дата выдачи, код подразделения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтудента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/РабочийСтолДиректора/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	КомФинСтудентов = ПолучитьСтудентов("Коммерческое");
	БюдФинСтудентов = ПолучитьСтудентов("Бюджетное");
	ОбщКолСтудентов = БюдФинСтудентов + КомФинСтудентов;
	
	ПостроитьДинамикуНаСервере();
	ПостроитьФормуОбученияНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСтудентов(ВидФин)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.СтатусСтудента = &СтатусСтудента
	|	И Студенты.ВидФинансирования = &ВидФин";
	
	Запрос.УстановитьПараметр("СтатусСтудента", Перечисления.СтатусыСтудента.Студент);
	
	Если ВидФин = "Коммерческое" Тогда
		Запрос.УстановитьПараметр("ВидФин", Перечисления.ВидыФинансирования.КоммерческоеФинансирование);
	ИначеЕсли ВидФин = "Бюджетное" Тогда
		Запрос.УстановитьПараметр("ВидФин", Перечисления.ВидыФинансирования.БюджетноеФинансирование);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	КоличествоСтудентов = РезультатЗапроса.Количество;
	Возврат КоличествоСтудентов;
КонецФункции

&НаСервере
Процедура ПостроитьДинамикуНаСервере()
	Динамика.Очистить();
	Динамика.АвтоТранспонирование = Ложь;
	Динамика.Обновление = Ложь;
	
	Платников = ПолучитьСтудентов("Коммерческое");
	Бюджетников = ПолучитьСтудентов("Бюджетное");
	ВсегоСтудентов = Платников + Бюджетников;

	Точка = Динамика.УстановитьТочку("Количество студентов");
	
	Серия = Динамика.Серии.Добавить("Всего студентов");	
	Динамика.УстановитьЗначение(Точка, Серия, ВсегоСтудентов, "Всего студентов", Строка(ВсегоСтудентов) + " студентов");
	
	Серия = Динамика.Серии.Добавить("Платников");	
	Динамика.УстановитьЗначение(Точка, Серия, Платников, "Платников", Строка(Платников) + " платников");
	
	Серия = Динамика.Серии.Добавить("Бюджетников");	
	Динамика.УстановитьЗначение(Точка, Серия, Бюджетников, "Бюджетников", Строка(Бюджетников) + " бюджетников");
КонецПроцедуры 

&НаСервере
Процедура ПостроитьФормуОбученияНаСервере()
	ДиаграммаФО.Очистить();
	ДиаграммаФО.АвтоТранспонирование = Ложь;
	ДиаграммаФО.Обновление = Ложь;
	
	Очников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.Очная);
	Заочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.Заочная);
	ОчноЗаочников = ПолучитьКоличествоПоФормеОбучения(Перечисления.ФормыОбучения.ОчноЗаочная);
	
	Точка = ДиаграммаФО.УстановитьТочку("Количество студентов");
	
	Серия1 = ДиаграммаФО.Серии.Добавить("Очников ");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия1, Очников, "Очников", Строка(Очников) + " очников");
	
	Серия2 = ДиаграммаФО.Серии.Добавить("Заочников");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия2, Заочников, "Заочников", Строка(Заочников) + " заочников");
	
	Серия3 = ДиаграммаФО.Серии.Добавить("Очно-заочников");	
	ДиаграммаФО.УстановитьЗначение(Точка, Серия3, ОчноЗаочников, "Очно-заочников", Строка(ОчноЗаочников) + " очно-заочников");
КонецПроцедуры 

&НаСервере
Функция ПолучитьКоличествоПоФормеОбучения(ФормаОбучения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.СтатусСтудента = &СтатусСтудента
	|	И Студенты.ТекущаяПрограммаОбучения.ФормаОбучения = &ФормаОбучения";
	
	Запрос.УстановитьПараметр("СтатусСтудента", Перечисления.СтатусыСтудента.Студент);
	Запрос.УстановитьПараметр("ФормаОбучения", ФормаОбучения);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	КоличествоСтудентов = РезультатЗапроса.Количество;
	Возврат КоличествоСтудентов;
КонецФункции
